# InvalidWorkplaneForStructuralFraming Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TrussFailures..::..InvalidWorkplaneForStructuralFraming Property
BuiltInFailures..::..TrussFailures Class See Also
---
Workplane not valid for Structural Framing component "[Family Name]"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidWorkplaneForStructuralFraming { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidWorkplaneForStructuralFraming As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidWorkplaneForStructuralFraming {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TrussFailures Class
Autodesk.Revit.DB Namespace